//
//  DataFetcher.swift
//  LetsSwap
//
//  Created by Ярослав Карпунькин on 09.12.2020.
//

import Foundation
import UIKit

class DataFetcher {
    //Логинка все функции..
    
    //Функция запроса новостей, в запросе будет фильтр в виде тегов
    //Функция для запроса новой пачки новостей
    
    //Функция getPost
    //Функция getUser
    
    //Функция makeOrder(отправляю после комментария) Post запрос
    
    //Сокеты(листнер) для оповещений
    
    //Post создать предложение
    
    //Update редактирование профиля
    //Update редактирование предложения
    
    //Delete удаление предложения
}
